Enterprise_Serivces/Cert/Gold/CSLCustomerService/result1/Iteration1/t1_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/csl/customer/contracts/2010/05/ICustomerService/GetPointsBalance</wsa:Action><wsa:MessageID>uuid:2459e6ad-a5bb-44e0-bdf9-0c7114c6566d</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslcustomerserviceqa1.testgs.pvt/CustomerService.svc</wsa:To></soap:Header><soap:Body><GetPointsBalance xmlns="http://www.gamestop.com/services/csl/customer/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><CustomerID xmlns="http://www.gamestop.com/services/csl/customer/contracts/messages/2011/04">2151373</CustomerID></request></GetPointsBalance></soap:Body></soap:Envelope>